jlab-sensing/ENTS-node-firmware/stm32/Src/lora_app.c
/* USER CODE END EF */

void LoRaWAN_Init(void)
{
  /* USER CODE BEGIN LoRaWAN_Init_LV */

  /* USER CODE END LoRaWAN_Init_LV */

  /* USER CODE BEGIN LoRaWAN_Init_1 */
  // load the upload interval
  //const UserConfiguration *cfg = UserConfigGet();
  // convert interval to ms
  //TxPeriodicity = (cfg->Upload_interval * 1000);
  // divide by number of sensors
  //TxPeriodicity /= cfg->enabled_sensors_count;
  // divide by 2 to keep upload buffer empty for failed uploads
  //TxPeriodicity /= 2;
  /* USER CODE END LoRaWAN_Init_1 */

  // initial period set to 10s to allow time sync first
  TxPeriodicity = 10000;

  UTIL_TIMER_Create(&StopJoinTimer, JOIN_TIME, UTIL_TIMER_ONESHOT, OnStopJoinTimerEvent, NULL);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStoreContextEvent), UTIL_SEQ_RFU, StoreContext);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), UTIL_SEQ_RFU, StopJoin);

  /* Init Info table used by LmHandler*/
  LoraInfo_Init();

  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks, APP_VERSION);

  LmHandlerConfigure(&LmHandlerParams);

  /* USER CODE BEGIN LoRaWAN_Init_2 */
  /* USER CODE END LoRaWAN_Init_2 */

  LmHandlerJoin(ActivationType, ForceRejoin);

  // start the tx timer
  UTIL_TIMER_Create(&TxTimer, TxPeriodicity, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
  UTIL_TIMER_Start(&TxTimer);

  /* USER CODE BEGIN LoRaWAN_Init_Last */

  /* USER CODE END LoRaWAN_Init_Last */
}

/* USER CODE BEGIN PB_Callbacks */

#if 0 /* User should remove the #if 0 statement and adapt the below code according with his needs*/
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case  BUT1_Pin:
      /* Note: when "EventType == TX_ON_TIMER" this GPIO is not initialized */
      if (EventType == TX_ON_EVENT)
      {
        UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
      }
      break;
    case  BUT2_Pin:
      UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), CFG_SEQ_Prio_0);
      break;
    case  BUT3_Pin:
      UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaStoreContextEvent), CFG_SEQ_Prio_0);
      break;
    default:
      break;
  }
}
#endif

/* USER CODE END PB_Callbacks */

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  /* USER CODE BEGIN OnRxData_1 */
  if ((appData != NULL) || (params != NULL))
  {

    static const char *slotStrings[] = {"1", "2", "C", "C Multicast", "B Ping-Slot", "B Multicast Ping-Slot"};

    APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Indication ==========\r\n");
    APP_LOG(TS_OFF, VLEVEL_H, "###### D/L FRAME:%04d | SLOT:%s | PORT:%d | DR:%d | RSSI:%d | SNR:%d\r\n",
            params->DownlinkCounter, slotStrings[params->RxSlot], appData->Port, params->Datarate, params->Rssi, params->Snr);
    switch (appData->Port)
    {
    // TODO add cases for incoming data on ports
    default:
      break;
    }
  }
  /* USER CODE END OnRxData_1 */
}

static void SendTxData(void)
{
  /* USER CODE BEGIN SendTxData_1 */

  // preconditions

  // local flag for if clock has been synced
  static bool clock_synced = false;

  // Sync clock
  if (!clock_synced) {
    // send request and heck return
    if (LmhpClockSyncAppTimeReq() == LORAMAC_HANDLER_SUCCESS) {
      APP_LOG(TS_OFF, VLEVEL_M, "Clock sync request send successfully\r\n")
      // toggle flag
      clock_synced = true;
      
      // Stop webserver after 60 seconds
      UserConfigSetupStop(60);

      const UserConfiguration *cfg = UserConfigGet();
      // convert interval to ms
      TxPeriodicity = (cfg->Upload_interval * 1000);
      // divide by number of sensors
      // NOTE John I think this is zero indexed so we need to add 1
      TxPeriodicity /= cfg->enabled_sensors_count + 1;
      // divide by 2 to keep upload buffer empty for failed uploads
      TxPeriodicity /= 2;

      APP_LOG(TS_OFF, VLEVEL_M, "Upload interval set to %lums\r\n", TxPeriodicity);

      // clamp to 10s
      if (TxPeriodicity < 10000) {
        TxPeriodicity = 10000;
        APP_LOG(TS_OFF, VLEVEL_L, "Warning : upload interval too low, clamping to 10s\r\n");
      }

      UTIL_TIMER_SetPeriod(&TxTimer, TxPeriodicity);


      // start taking measurements
      SensorsStart();
    }
    else {
      APP_LOG(TS_OFF, VLEVEL_M, "Could not sync clock, retrying on next tx\r\n");
      clock_synced = true;
    }
    // otherwise return
    return;
  }

  // check if radio is busy
  if (LmHandlerIsBusy())
  {
    APP_LOG(TS_ON, VLEVEL_M, "LmHandler is busy\r\n");
    return;
  }

  // check if buffer is empty
  if (FramBufferLen() <= 0)
  {
    APP_LOG(TS_ON, VLEVEL_M, "Nothing in buffer\r\n");
    return;
  }

  uint8_t battery_level = GetBatteryLevel();
  uint16_t temperature = SYS_GetTemperatureLevel();


  // Get max LoRaWAN payload size
  LoRaMacRegion_t region = 0;
  LmHandlerGetActiveRegion(&region);
  int8_t dr = 0;
  LmHandlerGetTxDatarate(&dr);
  uint8_t max_payload_size = lorawan_max_payload(region, dr);

  PayloadStatus payload_status = PAYLOAD_OK;
  payload_status = FormatPayload(AppData.Buffer, max_payload_size, (size_t*) &AppData.BufferSize);
  if (payload_status == PAYLOAD_ERROR) {
    APP_LOG(TS_ON, VLEVEL_M, "Error formatting payload\r\n");
    return;
  } else if (payload_status == PAYLOAD_NO_DATA) {
    APP_LOG(TS_ON, VLEVEL_M, "No data to send\r\n");
    return;
  }


  // Old code for measurements
  //FramStatus status = FramGet(AppData.Buffer, &AppData.BufferSize);
  //if (status != FRAM_OK)
  //{
  //  APP_LOG(TS_OFF, VLEVEL_M,
  //          "Error getting data from fram buffer. FramStatus = %d", status);
  //  return;
  //}

